In [1]:
import pandas as pd
import numpy as np

### Create 3 different Series, each of length 100, as follow:
1. The first a random number from 1 to 4
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
df1 = pd.Series(np.random.randint(1, high=4, size=100, dtype='int64'))
df2 = pd.Series(np.random.randint(1, high=3, size=100, dtype='int64'))
df3 = pd.Series(np.random.randint(10000, high=30000, size=100, dtype='int64'))

print(df1.dtype)
print(df2.dtype)
print(df3.dtype)

int64
int64
int64

### Let's create a DataFrame by joining the Series by column.

In [3]:
# 열을 기준으로 Series를 조인하여 데이터 프레임 생성
df = pd.concat([df1, df2, df3], axis=1)
df.head()

   0  1      2
0  2  2  23554
1  1  2  28076
2  2  2  29166
3  2  2  14464
4  3  2  26152

### Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0: 'bedrs', 1:'baths', 2:'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  baths  price_sqr_meter
0      2      2            23554
1      1      2            28076
2      2      2            29166
3      2      2            14464
4      3      2            26152

- **rename(): Pandas에서 데이터프레임의 컬럼(열) 또는 인덱스(행)의 이름을 변경하는 함수**

### Create a one column DataFrame with the values of the 3 Series and assing it to 'big column'

In [5]:
# 3개의 시리즈 값으로 하나의 열 데이터프레임을 생성

bigcolumn = pd.concat([df1, df2, df3])
print(type(bigcolumn))

<class 'pandas.core.series.Series'>

In [6]:
bigcolumn = pd.DataFrame(bigcolumn)
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [7]:
bigcolumn

        0
0       2
1       1
2       2
3       2
4       3
..    ...
95  18482
96  28730
97  27377
98  24492
99  12335

[300 rows x 1 columns]

- **to_frame(): Series 데이터를 DataFrame 형태로 변환**

##### pd.DataFrame() 직접 사용해서 데이터프레임으로 변환 가능 ↔ pd.Series()

- concat(): 단순한 이어붙이기 (붙이기 방향 선택 가능, axis=0,1)
- merge(): 수평으로 합치며, 데이터프레임 간 공통된 값을 가진 열이 있어야 한다. (on=기준이 되는 공통 열 이름), how)

### Oops, it seems it is going only until index 99. Is it true?

In [8]:
len(bigcolumn)

300

In [9]:
bigcolumn.shape

(300, 1)

### Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        1
2        2
3        2
4        3
..     ...
295  18482
296  28730
297  27377
298  24492
299  12335

[300 rows x 1 columns]

- **reset_index(level=...): 'level'은 다중 인덱스에서 특정 레벨만 초기화할 때 사용하는 옵션**

- drop=True: 기존 인덱스가 삭제되고 새로운 기본 인덱스 생성
- inplace=True: 원본 데이터프레임을 직접 수정